app/controllers/tasks_controller.rb

  def index
    @tasks = Task.all(:order => '`order`')
---
SELECT * FROM `tasks` ORDER BY `order`

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)

  def create
    tasks = Task.count + 1
    @task = Task.new(params[:task])
    @task.order = tasks
    respond_to do |format|
      if @task.save
---
SELECT count(*) AS count_all FROM `tasks`
INSERT INTO `tasks` (`updated_at`, `title`, `order`, `created_at`) VALUES('2009-06-09 13:37:02', 'Finish this todo list', 1, '2009-06-09 13:37:02')

  def update
    @task = Task.find(params[:id])
    respond_to do |format|
      if @task.update_attributes(params[:task])
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 1)
UPDATE `tasks` SET `updated_at` = '2009-08-05 16:48:09', `title` = 'First Task' WHERE `id` = 1

  def move_up
    begin
      @task = Task.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      logger.error("Attempt to access invalid task #{params[:id]}")
      redirect_to_index("Could not find that task")
    else
      if(@task.order > 1)
        prev = Task.find_by_order(@task.order - 1)
        prevOrder = prev.order
        prev.order = @task.order
        @task.order = prevOrder
        respond_to do |format|
          if @task.save && prev.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
SELECT * FROM `tasks` WHERE (`tasks`.`order` = 1) LIMIT 1
UPDATE `tasks` SET `updated_at` = '2009-08-05 15:48:39', `order` = 1 WHERE `id` = 2

  def move_down
    @task = Task.find(params[:id])
    if(@task.order < Task.count)
      nextTask = Task.find_by_order(@task.order + 1)
      nextOrder = nextTask.order
      nextTask.order = @task.order
      @task.order = nextOrder
      respond_to do |format|
        if @task.save && nextTask.save
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
SELECT count(*) AS count_all FROM `tasks`
SELECT * FROM `tasks` WHERE (`tasks`.`order` = 2) LIMIT 1
SELECT * FROM `tasks` ORDER BY `order`
UPDATE `tasks` SET `updated_at` = '2009-08-05 15:49:07', `order` = 2 WHERE `id` = 2

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM `tasks` WHERE (`tasks`.`id` = 2)
DELETE FROM `tasks` WHERE `id` = 2